---
type: SKPImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# SKPImportOptions

`Autodesk.Revit.DB.SKPImportOptions` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SKPImportOptions | — | `` |
| Constructor | SKPImportOptions | 2014 | `public SKPImportOptions ()` |